Repository: RedTurtle/collective.blog.portlets
Catalog: collective/blog/portlets/locales/*/LC_MESSAGES/collective.blog.portlets-*.po
Languages: it

source: Archive
it: Archivio

source: Archive view
it: Vista Archivio

source: The name of the archive view
it: Il nome della vista dell'archivio

source: Monthly archive
it: Archivio mensile

source: Last entries
it: Ultimi post

source: Entries
it: Post

source: The number of entries to show
it: Il numero di post da mostrare

source: month_1
it: mese_1

source: month_10
it: mese_10

source: month_11
it: mese_11

source: month_12
it: mese_12

source: month_2
it: mese_2

source: month_3
it: mese_3

source: month_4
it: mese_4

source: month_5
it: mese_5

source: month_6
it: mese_6

source: month_7
it: mese_7

source: month_8
it: mese_8

source: month_9
it: mese_9
